Repository: sbarkerzamora/R2-Wordpress-Backup
Catalog: languages/r2-wordpress-backup-*.po
Languages: es_es

source: Export
es_es: Exportar

source: Import
es_es: Importar

source: Backups
es_es: Copias de seguridad

source: Schedules
es_es: Programaciones

source: Settings
es_es: Ajustes

source: Backups stored in Cloudflare R2.
es_es: Copias de seguridad almacenadas en Cloudflare R2.

source: No backups yet. Use Export to create one.
es_es: Aún no hay copias. Usa Exportar para crear una.

source: Backup
es_es: Copia

source: Actions
es_es: Acciones

source: Download
es_es: Descargar

source: Restore
es_es: Restaurar

source: Delete
es_es: Eliminar

source: Create a full backup (files + database) and upload it to R2.
es_es: Crear una copia completa (archivos + base de datos) y subirla a R2.

source: Start backup
es_es: Iniciar copia

source: Creates a full backup (database + files) and uploads it to R2. This may take a few minutes.
es_es: Crea una copia completa (base de datos + archivos) y la sube a R2. Puede tardar unos minutos.

source: Restore this site from a backup stored in R2.
es_es: Restaurar este sitio desde una copia almacenada en R2.

source: Select a backup to restore. This will replace the current site data. Only use on this site.
es_es: Elige una copia para restaurar. Sustituirá los datos actuales del sitio. Solo en este sitio.

source: No backups in R2.
es_es: No hay copias en R2.

source: Action
es_es: Acción

source: Restore this backup
es_es: Restaurar esta copia

source: Reset plugin options and schedules. R2 credentials are kept unless you choose to clear them.
es_es: Restablecer opciones y programaciones del plugin. Las credenciales R2 se mantienen salvo que las borres.

source: Reset options and schedules
es_es: Restablecer opciones y programaciones

source: No automatic backup
es_es: Sin copia automática

source: Once daily
es_es: Una vez al día

source: Once weekly
es_es: Una vez a la semana

source: Once monthly
es_es: Una vez al mes

source: Configure automatic backups to R2.
es_es: Configurar copias automáticas a R2.

source: Automatic backup
es_es: Copia automática

source: Next run
es_es: Próxima ejecución

source: Save schedule
es_es: Guardar programación

source: Schedule saved.
es_es: Programación guardada.

source: Account ID
es_es: ID de cuenta

source: Access Key ID
es_es: ID de clave de acceso

source: Secret Access Key
es_es: Clave secreta de acceso

source: Leave blank to keep current
es_es: Dejar en blanco para mantener la actual

source: Leave blank to keep the current secret.
es_es: Deja en blanco para mantener la clave actual.

source: Bucket name
es_es: Nombre del bucket

source: Retention (keep last N backups)
es_es: Retención (mantener últimas N copias)

source: Exclude paths (one per line)
es_es: Excluir rutas (una por línea)

source: Exclude DB tables (one per line)
es_es: Excluir tablas de la BD (una por línea)

source: Save settings
es_es: Guardar ajustes

source: Test connection
es_es: Probar conexión

source: R2 free tier: 10 GB storage, 1M Class A and 10M Class B operations per month.
es_es: Plan gratuito R2: 10 GB almacenamiento, 1M operaciones Clase A y 10M Clase B al mes.

source: Settings saved.
es_es: Ajustes guardados.

source: Permission denied.
es_es: Permiso denegado.

source: Connection successful.
es_es: Conexión correcta.

source: Backup completed and uploaded to R2.
es_es: Copia completada y subida a R2.

source: Invalid key.
es_es: Clave no válida.

source: Restore completed.
es_es: Restauración completada.

source: Key
es_es: Clave

source: R2 credentials not configured.
es_es: Credenciales R2 no configuradas.

source: R2 credentials not configured. Save Account ID, Access Key, Secret Key, and Bucket.
es_es: Credenciales R2 no configuradas. Guarda ID de cuenta, clave de acceso, secreto y bucket.

source: Access denied. Check your R2 API token and bucket name.
es_es: Acceso denegado. Comprueba tu token API R2 y el nombre del bucket.

source: Bucket not found.
es_es: Bucket no encontrado.

source: Connection failed (HTTP %d).
es_es: Conexión fallida (HTTP %d).

source: Could not create ZIP file.
es_es: No se pudo crear el archivo ZIP.

source: No tables found.
es_es: No se encontraron tablas.

source: Could not open backup file.
es_es: No se pudo abrir el archivo de copia.

source: Could not read database file.
es_es: No se pudo leer el archivo de base de datos.

source: Database error during restore:
es_es: Error de base de datos durante la restauración:

source: File not found or not readable.
es_es: Archivo no encontrado o no legible.

source: Failed to read file.
es_es: Error al leer el archivo.

source: Upload failed (HTTP %d).
es_es: Subida fallida (HTTP %d).

source: Download failed (HTTP %d).
es_es: Descarga fallida (HTTP %d).

source: Failed to write file.
es_es: Error al escribir el archivo.

source: Delete failed (HTTP %d).
es_es: Eliminación fallida (HTTP %d).

source: Options and schedules have been reset.
es_es: Opciones y programaciones se han restablecido.

source: Backup deleted from R2.
es_es: Copia eliminada de R2.

source: Reset plugin options and schedules? R2 credentials will be kept.
es_es: ¿Restablecer opciones y programaciones del plugin? Las credenciales R2 se mantendrán.

source: Delete this backup from R2? This cannot be undone.
es_es: ¿Eliminar esta copia de R2? No se puede deshacer.

source: Restore this site from the selected backup? Current database and files will be replaced. This cannot be undone.
es_es: ¿Restaurar este sitio desde la copia seleccionada? Se reemplazarán la base de datos y los archivos actuales. No se puede deshacer.

source: Starting backup…
es_es: Iniciando copia…

source: Backup completed successfully.
es_es: Copia completada correctamente.

source: Backup failed.
es_es: Copia fallida.

source: Restoring…
es_es: Restaurando…

source: Restore failed.
es_es: Restauración fallida.

source: Request failed.
es_es: Solicitud fallida.

source: Connection failed.
es_es: Conexión fallida.

source: Reset failed.
es_es: Restablecimiento fallido.

source: Delete failed.
es_es: Eliminación fallida.

source: No backups yet
es_es: Aún no hay copias

source: Use Export to create a backup and upload it to R2.
es_es: Usa Exportar para crear una copia y subirla a R2.

source: Restore replaces site data
es_es: Restaurar reemplaza los datos del sitio

source: Restoring will replace the current database and wp-content files on this site. Make sure you understand the impact before continuing.
es_es: Restaurar reemplazará la base de datos y los archivos wp-content actuales de este sitio. Asegúrate de entender el impacto antes de continuar.

source: Reset configuration
es_es: Restablecer configuración

source: This will reset the plugin configuration and scheduled backups to their defaults. R2 credentials will be kept unless you remove them manually from Settings.
es_es: Esto restablecerá la configuración del plugin y las copias programadas a sus valores por defecto. Las credenciales R2 se mantendrán salvo que las borres en Ajustes.

source: Use this only if you want to start over with a clean configuration.
es_es: Usa esto solo si quieres empezar con una configuración limpia.

source: Restore this backup (destructive action)
es_es: Restaurar esta copia (acción destructiva)
